[
  {
    "id": 0,
    "company": "Robert Half",
    "type": "Temp Agency",
    "role": "Accounting and Office Work",
    "startDate": "June 2020",
    "endDate": "December 2020",
    "jobDescription": "Started out in June of 2021 navigating traffic for the San Joaquin County Hospital, then I transitioned into a role as an Underwriting Assistant for a company called Golden Bear Insurance, I then worked for San Joaquin County as an election technician, I helped out and filled in as a receptionist for a variety of companies, and then my final position was as an Accounts Payable Assistant for Delta Bluegrass Company",
    "personalExperience": "I felt like I learned a lot throughout my time at Robert Half, I learned how to use new softwares and I learned what I do and do not like about working. I also built some amazing connections and I was happy with my time there. I needed to get a full time steady job and that is why I quit and left for Diversified Products", 
    "img": "https://thebestandbrightest.com/wp-content/uploads/2020/03/rh-logo-transparent-300x41.png.webp",
    "display": false
  },
  {
    "id":1,
    "company": "Cullinan Group Foundation",
    "type": "Volunteer",
    "role": "Finance Assistant",
    "startDate": "July 2020",
    "endDate": "January 2021",
    "jobDescription": "I worked as a Finance Assistant for the duration of my employment as a volunteer. I learned how to use Microsoft Teams, Microsoft Excel, and even a bit of project management",
    "personalExperience": "I loved this job so much, it was my favorite job to work at because the Founder is such an amazing person. She was caring, understanding, and worked around my schedule, the only issue is that this job was a volunteer position, so I had to find a job to ensure I had income, if it was up to me I would not have quit because I genuinely enjoyed my time volunteering.",
    "img": "https://th.bing.com/th/id/R.d7b1369962a2de40e38eeab569fda525?rik=%2fickXkxt3fkstw&riu=http%3a%2f%2fenacademic.com%2fpictures%2fenwiki%2f83%2fStockton_skyline.jpeg&ehk=SblpC23pz4xZI1Kbz1Sg74%2btDHEmtU3aalVW17924v8%3d&risl=&pid=ImgRaw&r=0",
    "display": false
  },
  {
    "id":2,
    "company": "Diversified Products Manufacturing",
    "type": "Full Time Employment",
    "role": "Accounting Assistant",
    "startDate": "December 2020",
    "endDate": "June 2021",
    "jobDescription": "I was hired to as an Accounting Assistant and that was my role for the duration of employment for the company. The company used QuickBooks and Microsoft Excel, I assisted with paying bills, receiving payments and putting together financial spreadsheets",
    "personalExperience": "The work experience was good I learned a lot about QuickBooks and Excel. But the company culture was awful, there was a lot of hostility within the company, the management was extremely toxic and the company did a lof of unethical and illegal things. I was fired unjustly because I voiced my concerns adn was told I was the issue. I recently went to court with them over unemployment issues and the company tried to lie and say that I cussed them out, threw a fit and called them names, which is not true. The president of the company cussed me out on my last day of the job. I know it may not be professional to call out a previous employer but it does not sit right with me if nobody knew about how poorly that company treated me and other employees within the company. If you asked my current co-workers and company they can tell you that none of that stuff is true and they enjoy working with me.",
    "img": "https://water.ca.gov/-/media/DWR-Images/Oroville/KG_oroville_13202_06_18_18.jpg?mw=768&hash=6A21743F4C5BE5C8BCDF0E6AE274D46D8C772FAA",
    "display": false  
  },
  {
    "id":3,
    "company": "Robert Half",
    "type": "Temp Agency",
    "role": "Accountant",
    "startDate": "September 2021",
    "endDate": "December 2021",
    "jobDescription": "I came back to work for Robert Half and I worked in Accounting for my two assignments, my first assignment was for Fuel Delivery Services which used Sage 500 and I Was in charge of placing orders and check runs, and my second assignment was for Thomas Allen Vineyard and Winery which used QuickBooks I Was in charge of placing orders, paying bills and check runs.",
    "personalExperience": "After getting terminated from Diversified Products, I had to find another job. I had issues finding employment even though I had some good work experience and a BS in Business Admin. I had to work for a temp agency again. The only issues I encountered where the inconsistent hours and the jobs being temporary. The jobs I worked at were fine and I didn't have any real issues working for a temp agency. I did move to Turlock during my second position and I had to drive an hour everyday for work, which took a tole on me and was the reason I quit for a new position that was in Turlock.",
    "img": "https://thebestandbrightest.com/wp-content/uploads/2020/03/rh-logo-transparent-300x41.png.webp",
    "display": false
  },
  {
    "id":4,
    "company": "Grower Direct Nut",
    "type": "Temporary Position",
    "role": "Accounts Payable Analyst",
    "startDate": "December 2021",
    "endDate": "January 2022",
    "jobDescription": "I worked in Accounts Payable and I was in charge of filing papers, placing orders and I learned how to use Sage 500 because the company used this software.",
    "personalExperience": "I was happy to take this job mainly because it was 10 minutes from where I lived. It was good work experience and learning new software is always nice. But I was hired through a temp agency in Turlock. I had no issues working here and I left this job for a more stable position at Cash Offers LLC",
    "img": "https://www.anatu.com/wp-content/themes/ana-trading/images/logo-grower-direct-nut.png",
    "display": false
  },
  {
    "id":5,
    "company": "Cash Offers LLC",
    "type": "Independent Contractor",
    "role": "Executive Assistant",
    "startDate": "January 2022",
    "endDate": "March 2022",
    "jobDescription": "As an executive Assistant there was a lot of tasks I had to complete. I helped this company start up their QuickBooks, I assisted with installing some of the technology and getting contracts with multiple businesses. I assisted with responding to emails, and I was in charge of opening and closing the office everyday.",
    "personalExperience": "I liked working here because it was more stable and I had a lot of responsibilities, but I did feel that I was underpaid for the huge responsibility load I had. I had a small issue with this company because when I first started I told them that I would need some time to take my pregnant wife to her Doctor Appointments. At first everything was fine and then later I was told I was inconveniencing them by missing time to take her to her appointments, this happened one day after I was at the hospital for an anxiety attack and heat exhaustion. It bothered me because I told them I could make up the hours and they didn't want me to. It was a fine experience but I wish they could have been a bit more understanding. Also I never even received my last paycheck from working at the company and I tried to contact them so many times to come in and get my check and I got no response it is very frustrating.",
    "img": "https://cdn.carrot.com/uploads/sites/46089/2020/04/Version_2-transparent-file-e1586377055157.png",
    "display": false
  },
  {
    "id":6,
    "company": "Alpha Works/Bitwise",
    "type": "Apprenticeship",
    "role": "React Developer",
    "startDate": "March 2022",
    "endDate": "Current",
    "jobDescription": "I am being taught how to use React for front end development. At first I was taught some of the basics of Javascript like setting up variables, for loops, functions, and Object Oriented Programing, then I learned some intermediate concepts such as AJAX (async Javascript and XML), after that I dove into React and learned React Hooks such as useState, useEffect, useRef, React Routing, Context, and now Redux",
    "personalExperience": "I do not know where to begin, this company is the best company I ever worked for. I always thought I wanted to work for big tech, but after getting hired as a React Apprentice my mind changed. I really love working here for Alpha Works and I hope that once my apprenticeship is done I'll get a job at Bitwise. The company culture is amazing, everyone here actually values you, cares about you, and treats you like a human rather than a number. They worked around my schedule when I had to take my pregnant wife to her doctor appointments and they always tell me to make sure my family is taken care of, because family comes first. I love what I do for work, I enjoy working with my friends at this company, and I feel supported by Alpha Works and Bitwise. I can see myself growing my career here and I hope I can work here for as long as I can.",
    "img": "https://www.fresnocitycollege.edu/uploaded-files/images/common/logos/bitwise-industries-logo-graphic.jpg",
    "display": false
  }
]