[
  {
    "project": "Python GUI Photo Selector",
    "description": "A simple user interface to be able to view images, it was built with the python language.",
    "url": "https://github.com/javiguerra777/py-gui-photo-selector",
    "image": "images/pythonGUI.JPEG",
    "howToRun": "have Python installed in your computer and run python app.py or you can use the VScode run feature to run the application.",
    "experiences":"I learned how to build a user interface.",
    "additionalInfo": "I have been interested in building user interfaces for a while and I heard that PySimpleGui was a good choice to get started. I know you can also build a user interface with Java as well and I might look into that later once I master building user interfaces."
  },
  {
    "project": "c++ ufo game",
    "description": "A ufo game similar to hangman and is run on the terminal, this project was made with the language c++.",
    "url": "https://github.com/javiguerra777/ufo-game",
    "image": "images/UFO.JPEG",
    "howToRun": "If you have c++ installed on your computer then you run gpp ufo.cpp then run the command ./a.exe or you can run it in VScode with the built in run feature.",
    "experiences": "I was learning more about the c++ language and I ended up building this game.",
    "additionalInfo": "I found the c++ language interesting due to how powerful and fast it executes during run time. I wanted to learn what real uses c++ has, this was a very good project to learn about c++."
  },
  {
    "project": "React Game Project",
    "description": "A number guessing game made with React",
    "url": "https://github.com/javiguerra777/React-Game-Project",
    "image": "images/numberGuesser.JPEG",
    "howToRun": "Use the npm start command to run this app.",
    "experiences": "I learned about useState and props in this project.",
    "additionalInfo": "This was the first project I made in my React Apprenticeship and I think it was a great starting point to get a better understanding of useState and passing props."
  },
  {
    "project": "React and MySQL",
    "description": "I made a simple store using React for the frontend. For the backend I used Express and MySQL.",
    "url": "https://github.com/javiguerra777/react-mysql-fullstack",
    "image": "images/reactMySQL.JPEG",
    "howToRun": "Use the npm start command to run this application, this repository is only the front end, so you also have to clone a backend I made and run those both at the same time. I will provide the link to the backend on this webpage.Because if you don't have the backend this project will not run.",
    "experiences": "I learned more about Axios and the different Http GET, POST, PUT, and DELETE methods. I learned more about MySQL and how Express works as well.",
    "additionalInfo": "I had already created a backend for BayValley Tech and I wanted to connect it to a React frontend, that is what inspired me to create this project. I need to improve the styling."
  },
  {
    "project": "Backend Final",
    "description": "This is the backend that goes along with the React frontend, the backend uses Express and MySQL.",
    "url": "https://github.com/javiguerra777/Backend-Final-Javier-Guerra",
    "image": "images/backendFinal.JPEG",
    "howToRun": "If you run the npm start command, the project will automatically run nodemon app.js. Also make sure you have MySQL installed on your computer because that is the database I used for this project. I also used gitignore to hide my .env file so take a look at the code and create your own .env file and include the proper keys.",
    "experiences": "I learned more about nodemon and how to connect Express and MySQL.",
    "additionalInfo": "I was having trouble wrapping my head around fullstack development, but after Sarah my lead taught us about using Axios I tried testing Axios on my front end to connect to my backend and it worked. I was very happy to finally better understand fullstack development, so, thank you Sarah."
  },
  {
    "project": "c++ login system",
    "description": "Login system created in c++ and is run on the terminal",
    "url": "https://github.com/javiguerra777/cpp-login-system",
    "image": "images/cppLogin.JPEG",
    "howToRun": "You can run this on the terminal if you have c++ installed on your system and if you run gpp app.cpp and then ./a.exe. You can also use VScode's built in run feature to run this program.",
    "experiences": "I learned how to create to files read files, and talk to files in c++.",
    "additionalInfo": "The code works fine, but I was trying to add additional features, so if you run into any issues try to debug those issues."
  },
  {
    "project": "React Weather App",
    "description": "A weather app that uses React to display a 7-8 day forecast and changes upon the city the user enters",
    "url": "https://github.com/javiguerra777/weather-app-apprenticeship",
    "image": "images/reactWeather.JPEG",
    "howToRun": "Use npm start to run this project, also you will have to create your own .env file since I used gitignore to hide my API keys, the weather API I used has a limit on how many API calls you are allowed per key.",
    "experiences": "I learned a lot about React testing and connecting multiple API's together. I also incorporated Redux to work with my ErrorBoundary.",
    "additionalInfo": "This was a fun little project assigned to me during my apprenticeship and I learned how to use Context, Redux, and React testing."
  },
  {
    "project": "Social Media App",
    "description": "A social media app made with React and Firebase.",
    "url": "https://github.com/javiguerra777/social-media-app",
    "image": "images/socialMedia.JPEG",
    "howToRun": "Run npm start to run this project.",
    "experiences": "I wanted to see how to create a social media clone, this project has a good foundation, but I was planning on adding additional features when I get time and better understand Firebase's queries.",
    "additionalInfo": "I enjoyed learning about Firebase, but I still have a lot to learn about Firebase before I can complete this application"
  },
  {
    "project": "Brewery Locator App",
    "description": "Brewery Locator App made with React and allows the user to display Breweries in whichever location the user desires.",
    "url": "https://github.com/javiguerra777/brewery-locator",
    "image": "images/brewery.JPEG",
    "howToRun": "Use npm start to run this project. Also I used a gitignore to hide my API keys, so you will have to create your own .env file and get your own API keys.",
    "experiences": "I learned how to get 2 different APIs to connect, I learned more about how to use Maps and building a map application. I learned more about form validation and utilized local storage.",
    "additionalInfo": "This was a project that we had to do for our apprenticeship and I worked with a teammate on this project. I had fun doing this project and styling it."
  },
  {
    "project": "Student Directory App",
    "description": "Student Directory App built with React.",
    "url": "https://github.com/javiguerra777/React-Student-Directory",
    "image": "images/studentDirectory.JPEG",
    "howToRun": "Run npm start to get this app to work.",
    "experiences": "I learned a lot about the spread operator and connecting multiple arrays together. I learned about useState, and useEffect more as well. I also learned about conditionally styling in React, form and form validation, the onChange handler and I used local storage as well.",
    "additionalInfo": "I worked on this project with a teammate of mine and we were still fairly new to React, but if we could go back and make some changes we would."
  }
]